Revit 2024 API
BuiltInFailures.CopyPasteFailures.CannotCopyMultipleSketchParents Property
 Copying elements from unrelated Workplanes together is not supported in families. Try copying elements separately.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotCopyMultipleSketchParents { get; }
Visual Basic
Public Shared ReadOnly Property CannotCopyMultipleSketchParents As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotCopyMultipleSketchParents {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CopyPasteFailures Class
Autodesk.Revit.DB Namespace